SeniorDesignTeamOmicron/SparkFun-nRF52-Embedded-App/LogiSteps/main.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>


#include "nordic_common.h"
#include "nrf.h"
#include "ble_advdata.h"
#include "app_error.h"
#include "app_timer.h"
#include "nrf_pwr_mgmt.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"


#include "our_ble.h"
#include "our_saadc.h"



#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


// FROM_SERVICE_TUTORIAL: Declare a service structure for our application
ble_os_t m_our_service;


// OUR_JOB: Step 3.G, Declare an app_timer id variable and define our timer interval and define a timer interval
//APP_TIMER_DEF(m_our_char_timer_id);
//#define OUR_CHAR_TIMER_INTERVAL   APP_TIMER_TICKS(1000)


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name) {
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


// ALREADY_DONE_FOR_YOU: This is a timer event handler
//static void timer_timeout_handler(void * p_context) {
    // OUR_JOB: Step 3.F, Update temperature and characteristic value.

//}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
void timers_init(void) {
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);


    // OUR_JOB: Step 3.H, Initiate our timer
    // app_timer_create(&m_our_char_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
}


/**@brief Function for starting timers.
 */
void application_timers_start(void) {
    // OUR_JOB: Step 3.I, Start our timer 
    //app_timer_start(m_our_char_timer_id, OUR_CHAR_TIMER_INTERVAL, NULL);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
void sleep_mode_enter(void) {
    ret_code_t err_code;

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module.
 */
void log_init(void) {
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
void power_management_init(void) {
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
void idle_state_handle(void) {
    if (NRF_LOG_PROCESS() == false) {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for application main entry.
 */
int main(void) {
    bool erase_bonds;

    //general inits
    log_init();
    power_management_init();
    application_timers_start();
    timers_init();


    //ble inits
    ble_stack_init();
    gap_params_init();
    gatt_init();

    services_init();
    advertising_init();

    conn_params_init();
    peer_manager_init();


    //saadc inits
    saadc_init();
    saadc_sampling_event_init();


    // Start execution.
    NRF_LOG_INFO("OurCharacteristics tutorial started.");
    advertising_start(erase_bonds);
    saadc_sampling_event_enable();

    // Enter main loop.
    for (;;) {
        idle_state_handle();
    }
}